package tennisPro;

public class temp {
    public static void main(String[] args) {

        /* [테니스 게임 구현]
            테니스 : 단식 혹은 복식 구성
                   양 선수가 네트를 사이에 두고 라켓으로 공을 쳐서 상대방 코트로 떨어뜨리는 스포츠
                   남자 5판 3선승, 여자 3판 2선승
            1. 게임 구성
            2. 게임 규칙
            3. 게임 요소
            4. 데이터
            5. 처리 순서
            5. 클래스 구조
            6. 메소드
            7. 인터페이스
            8. 전체 구조
         */


        /*
        1. 게임 구성
            - 단식 1:1, 복식 2: 2
            - 선수 최소 2명 필요
            - 점수 체계 : 포인트 0-15-30-40, 게임, 세트
            - 게임 : 포인트 4점 이상 획득 (조건 : 상대와 최소 2점 이상 차이)
            - 듀스 : 40:40 상황 발생 시 연속으로 2점을 따내는 선수가 게임 획득
                    1점 먼저 획득 시 스코어보드에 어드밴티지 AD로 표기
            - 세트 : 6 게임 이상 획득 (조건 : 상대와 최소 2점 이상 차이)
            - 타이브레이크 : 6:6 동점 상황 발생 시 타이브레이크 진행
                            점수 7점 이상 획득하고 상대보다 2점 앞설 경우 세트 획득
            - 매치 :
                    5판 3선승제 : 5 세트 중 3 세트 이기면 승리
                    3판 2선승제 : 3 세트 중 2세트 이기면 승리
         */

        /*
        2. 게임 요소
        - 변수 : player, point, game, set, match, winner,



         */








    }




}
