package blackjack;

public class Rules {

	public static void main(String[] args) {


		/*
			왜 이거를 하냐면.. 로또 하기 시름..
			재미없는거 하면 의욕 상실 됨

			뭔가 만들어봐야 내가 뭘 알고 뭘 모르는지 파악이 될 것 같고
			모르는거나 헷갈리는거는 그냥.. 만들면서 검색하면서 
			직접 써보는게 훨씬 기억에 남으니까
			내가 아는게 뭘까 이런 느낌.. 

			그리고 나중에 어떤 카드가 나올 지 예측하는걸 해보고 싶음

			## BlackJack Rules
			규칙이 뭐야 .. 블랙잭, 버스트,힛,스탠드,인슈어런스,스플릿..복잡한데 처음엔 걍 블랙잭, 버스트, 무승부push

			카드 : 카드덱 52장 하트, 클로버, 스페이드, 숫자 2~10, JQK는 10점, A는.. 1 또는 11인데 이것도 복잡한데..

			게임 순서:
			딜러 2장, 플레이어 2장씩 받고 딜러 카드 1장 공개, 1장 비공개
			플레이어가 딜러 카드 보고 Hit, Stand 결정
			딜러 차례인데.. 17이상이면 안뽑고 17미만이면 무조건 뽑아야 되는데
			이거 너무 복잡함 지금.. 처음부터 이런식이면 좀 그런데
			그럼 쉬운 것부터 먼저 만들고 규칙을 더 추가하는 걸로
			배팅도 해야하니까 배팅 금액도 올려야 하고

			그리고 플레이어는 선택을 해야함
			입력 받아야함 hit stand


			## version 1
			카드 랜덤 생성 (2-10)
			딜러
			플레이어
			플레이하시겠습니까? y/n
			딜러 1장
			플레이어 1장
			카드 오픈
			계속 플레이 하시겠습니까? y/n
			반복
			딜러 혹은 플레이어가 뽑은 카드 숫자의 합이 21이 되면 블랙잭!, 21 초과하면 버스트! 종료
			이 경우에는 
			계속 플레이 하시겠습니까 안나오게	
					
			*/


	}

}
